//
//  Phrase.swift
//  myDogGallery
//
//  Created by 이홍렬 on 2023/04/25.
//

import Foundation

struct QuestionAnswer {
    var question: String
    var answer: String
}

let questionList = [
    QuestionAnswer(question: "강아지를 키우려면 어떤 준비를 해야되나요?", answer: "강아지를 키우고자 할때 가장 중요한건 우선 나는 강아지를 키울 수 있는 사람인가? 라는 질문에 대한 답을 하셔야 합니다.즉, 강아지를 키우고자 하는 바램이나 열망이 중요한게 아니라 본인이 자신의 삶의 일부를 떼어서 강아지에게 줄 수 있는지를 확인하는게 중요하다는것이죠."),
    QuestionAnswer(question: "반려동물로 강아지를 키우려면 꼭 알아야 할것들이 어떤게 있나요?", answer: "가장 얇은 책 1권, 가장 두꺼운책 1권, 그리고 표지가 예뻐서 읽어보고 싶게 생긴 책 1권을 이렇게 3권 구매하셔서 처음부터 끝까지 정독을 하시고 앞으로 20년이라는 시간동안의 장기 계획속에서 강아지는 어떤 포지션으로 가족구성원으로 존재할지에 대한 고민을 해보시는걸 추천드립니다."),
    QuestionAnswer(question: "강아지 키울려고 하는데 주의 해야 할점 같은거 있을까요?", answer: "강아지를 처음 키우시는 거면 강아지에 대한 공부가 많이 필요합니다. 강아지를 키우는데 드는 비용, 강아지들이 잘 걸리는 질환, 훈련의 방법, 키우는데 어려운 점, 품종마다 잘 걸리는 질환이 다르므로 키우고자하는 품종에 대해 알아두시는 것이 좋습니다.")
]
