//
//  Phrase.swift
//  myDogGallery
//
//  Created by 이홍렬 on 2023/04/25.
//

import Foundation

struct QuestionAnswer {
    var question: String
    var answer: String
}



let questionList = [
    QuestionAnswer(question: "강아지를 키우려면 어떤 준비를 해야되나요?", answer: "강아지를 키우고자 할때 가장 중요한건 우선 나는 강아지를 키울 수 있는 사람인가? 라는 질문에 대한 답을 하셔야 합니다.즉, 강아지를 키우고자 하는 바램이나 열망이 중요한게 아니라 본인이 자신의 삶의 일부를 떼어서 강아지에게 줄 수 있는지를 확인하는게 중요하다는것이죠.그래서 추천하는것은 강아지를 키우는것에 관계한 책 3권을 서점에서 구매하셔서 처음부터 끝까지 정독하시는걸 추천드립니다. 그 속에 거의 모든 질문의 답이 들어 있을 것이나만약 책 3권을 읽는게 힘들거나 어렵다고 생각되신다면 강아지를 키우지 않으시는걸 추천드립니다. 강아지를 키운다는것은 고작 책 3권 정독하는것보다 몇곱절 더 어렵고 힘들며 정성이 들어가야 하는일이니까요. 특히 강아지를 키우는데 최소 기준이라고 할 수 있는것은 산책의 횟수이며 강아지 최소 산책 횟수 기준은 아침저녁 하루 2회 이상 각 10분 이상이니 아침에 집앞 산책 10분을 다녀올 여건이 되지 않는다면 강아지를 키우지 않는것이 그 강아지를 위해 현명한 길입니다. 강아지를 사랑하는 표현의 방법에는 어떤때는 키우지 않는것이 가장 좋은 방법이 되기도 하니까요."),
    QuestionAnswer(question: "반려동물로 강아지를 키우려면 꼭 알아야 할것들이 어떤게 있나요?", answer: "자녀들때문에 강아지를 키우는 집에서 아이들이 뭔가를 알아봐야 어차피 관리는 부모가 하게 되어 있습니다. 고로, 부모가 누구보다도 더 잘 알아야 하는것이죠. 자녀분들이 자기들이 다 관리하겠다고 말하죠? 그거 그렇게 되는 경우 지금까지 수십년동안 단 한차례도 본적 없습니다. 애들이야 강아지 이뻐라만 했지 아침에 등교해서 학원까지 거치고 늦은 시간 집에 오면 땡입니다. 즉, 강아지와 함께 있는 대부분의 시간은 집에 있는 부모의 몫인거죠. 때문에 아이들이 뭔가를 잘 알게 하기보다는 부모들이 더 잘 알아야 하기에 지금 당장 서점에 가셔서 가장 얇은 책 1권, 가장 두꺼운책 1권, 그리고 표지가 예뻐서 읽어보고 싶게 생긴 책 1권을 이렇게 3권 구매하셔서 처음부터 끝까지 정독을 하시고 앞으로 20년이라는 시간동안의 장기 계획속에서 강아지는 어떤 포지션으로 가족구성원으로 존재할지에 대한 고민을 해보시는걸 추천드립니다."),
    QuestionAnswer(question: "강아지 키울려고 하는데 주의 해야 할점 같은거 있을까요?", answer: "강아지를 처음 키우시는 거면 강아지에 대한 공부가 많이 필요합니다. 강아지를 키우는데 드는 비용, 강아지들이 잘 걸리는 질환, 훈련의 방법, 키우는데 어려운 점, 품종마다 잘 걸리는 질환이 다르므로 키우고자하는 품종에 대해 알아두시는 것이 좋습니다. 처음키우실 때 추천드릴 만한 품종으로는 성격이 온화한 편이며, 사람을 잘 따르고, 집안에서 키우기 적합한 소형견이 추천됩니다. 말티즈, 퍼그, 포메라니안, 비숑프리제, 시츄, 토이푸들 등이 있습니다. 이러한 견종들은 주변에서도 많이 키우기 때문에 키우는 팁을 얻기도 수월합니다.")
]
