//
//  Phrase.swift
//  myDogGallery
//
//  Created by 이홍렬 on 2023/04/25.
//

import Foundation

let phraselist = [
    "식사는 매번 규칙적인 시간 정해진 그릇에 제공해야 강아지의 건강한 식습관이 형성됩니다.",
    "반려견의 휴식공간은 유리나 거울이 보이지 않는 곳으로 지정해 주세요. 어린 반려견은 그것을 자신이라 생각지 못하고 다른 동물로 생각합니다.",
     "반려견은 자신의 몸을 숨기고 쉴 때 편안함을 느껴요. 너무 개방적인 위치보다는 소파와 벽 사이, 벽과 침대 사이와 같은 곳이 좋습니다.",
    "어린 강아지는 주로 식사 후 10~30분 사이에 배설하는데, 이 시간대에 배변 장소를 찾기 위해 냄새를 맡거나 빙글빙글 도는 행동을 하는 게 포착되면 즉시 배변 장소로 유도합니다.",
    "배변이 즐거운 활동이라는 인식을 심어줘야 해요. 지정한 배변 장소로 이동해 배변을 마치면 크게 칭찬해주면서 간식 등의 보상을 해줍니다.",
    "집안에서 목줄과 걷기에 적응이 되면 집 밖으로 나가 천천히 산책량을 늘려갑니다. 훈련에 잘 따라오면 보상을 해줍니다."
]
