//
//  Phrase.swift
//  myDogGallery
//
//  Created by 이홍렬 on 2023/04/25.
//

import Foundation

let phraselist = [
    "댕댕이도 규칙적인 식생활은 필수 강아지도 사람과 마찬가지로 규칙적인 식생활이 필요합니다.\n특히 성장기에 올바른 식습관을 들여야 평생 건강한 댕댕이로 자랄 수 있어요.",
    "강아지를 집에 데려오면 처음 하는 행동이 배변입니다. 낯선 공간에 적응하기 위한 첫 신호라 할 수 있죠.\n어린 강아지는 하루에 10~15번 정도 배뇨를 하고, 5~7번 정도의 배변을 합니다.",
     "함께 있을 땐 한없이 천사 같지만 견주가 출근하거나 외출한 뒤 한없이 하울링을 하거나 집안 물건을 찢어 놓는 등 문제행동을 한다면 혼자 있는 댕댕이의 행동을 관찰하고 그에 맞게 혼자 있는 시간을 준비해주면 좋아요.",
    "사회화를 위한 첫 단계는 산책입니다.\n산책 훈련은 집안에서 먼저 시작하는데, 목줄을 채우고 견주의 발 속도에 맞춰 천천히 집안을 걸어 다닙니다.\n훈련에 잘 따라오면 보상을 해줍니다. 집안에서 목줄과 걷기에 적응이 되면 집 밖으로 나가 천천히 산책량을 늘려갑니다. ",
    "간식 로봇도 자동 급식기와 마찬가지로 놀이 시각을 예약해 자동으로 놀아주기를 할 수 있고, 간식 토출 횟수를 지정해 간식량을 조절할 수 있어요.\n놀이를 마치면 활동량과 놀이시간을 알려주는 리포트도 확인할 수 있답니다."
]
